tests/integration/bajaj/test_data/mechanic_feed.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://local.bajaj.gladminds.co:8000/api/v1/feed/">
  <SOAP-ENV:Body>
    <ns1:postMechanic>
      <ns1:ObjectList>
        <ns1:MechanicData>
          <ns1:MechanicModel>
            <ns1:PHONE_NUMBER>1234567890</ns1:PHONE_NUMBER>
            <ns1:LAST_NAME>lastMECH</ns1:LAST_NAME>
            <ns1:DISTRICT>Bangalore</ns1:DISTRICT>
            <ns1:DOB>2012-12-27</ns1:DOB>
            <ns1:FIRST_NAME>firstMECH</ns1:FIRST_NAME>
            <ns1:SHOP_NAME>XYZ</ns1:SHOP_NAME>
            <ns1:STATE>Karnataka</ns1:STATE>
            <ns1:PINCODE>800001</ns1:PINCODE>
            <ns1:DIST_ID>dist001</ns1:DIST_ID>
          </ns1:MechanicModel>
        </ns1:MechanicData>
      </ns1:ObjectList>
      <ns1:Credential>
        <ns1:UserName>bajaj</ns1:UserName>
        <ns1:Password>bajaj</ns1:Password>
      </ns1:Credential>
    </ns1:postMechanic>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>